package com.oneapp.oneappandroidapp.util;

import java.util.HashMap;

public class QAA {

    public static HashMap<String, String> getQAAMap() {
        HashMap<String, String> map = new HashMap<>();
        map.put("北京哪些景点值得打卡？", "值得打卡的景点有故宫、天安门、南锣鼓巷、雍和宫、国家博物馆、天坛公园、颐和园、圆明园、八达岭长城、明十三陵等。");
        map.put("去北京故宫有哪些注意事项？", "北京故宫位于东城区，开放时间为8:30~17:00，旺季成人60元/人、淡季40元/人，故宫博物馆官网、公众号“故宫博物院观众服务”可预约；提前10天可预约。温馨提示：周一闭馆，不要跑空啦~");
        map.put("去北京天安门有哪些注意事项？", "提前在“中华人民共和国国旗网”查看每天升旗的时间，带好身份证！排队刷身份证进入！");
        map.put("去南锣鼓巷需要门票吗？", "南锣鼓巷位于东城区，不需要门票喔！免费游玩且全天开放。");
        map.put("去雍和宫需要门票吗？", "雍和宫位于东城区，门票25元，开放时间为9:00~16:30。");
        map.put("去国家博物馆有哪些注意事项？","国家博物馆位于东城区，开放时间为9:00~17:00，免费，关注公众号“国家博物馆”，提前7天可预约。温馨提示：周一闭馆，不要跑空啦~");
        map.put("去天坛公园有哪些注意事项？","天坛公园位于东城区，门票15元，开放时间为8:00~17:30，关注公众号“天坛”，提前7天可预约。");
        map.put("去颐和园有哪些注意事项？","颐和园位于海淀区，联票60元，开放时间为6:30~18:00，关注公众号“颐和园”，提前7天可预约。");
        map.put("去圆明园需要门票吗？","需要，圆明园门票10元。");
        map.put("圆明园的开放时间是什么时候？","开放时间为9:00~19:00。");
        map.put("八达岭长城的门票需要多少钱？","八达岭长城的门票需要40元。");
        map.put("八达岭长城的开放时间是什么时候？","开放时间为9:00~16:00。");
        map.put("八达岭长城在哪个区？","延庆区。");
        map.put("明十三陵的门票需要多少钱？","明十三陵的门票分别为长陵45元、定陵60元、神道35元，联票110元。");
        map.put("明十三陵的开放时间是什么时候？","开放时间：8:00~18:00。");
        map.put("明十三陵在哪个区？","昌平区。");
        map.put("北京哪些美食街区值得打卡？","您可以打卡簋街、牛街、护国寺街、前门大街、南锣鼓巷。");
        map.put("簋街有哪些好吃的店？","北新桥卤煮老店、福荣居褡裢火烧、聚福园清真餐厅、爪王烤鸡手、雍和炸鸡、胡大小龙虾。");
        map.put("牛街有哪些好吃的店？","洪记小吃店、白记年糕、伊宝荷叶甑糕、宫廷香酥牛肉饼、牛街老爆肚满、聚宝源、奶酪魏、满记烧饼、宝记豆汁店。");
        map.put("护国寺街有哪些好吃的店？", "护国寺小吃、柳泉居、富华斋。");
        map.put("前门大街有哪些好吃的店？","吴裕泰茶庄、锦芳小吃、门框卤煮。");
        map.put("南锣鼓巷有哪些好吃的店？","姚记炒肝、方砖厂炸酱面。");
        map.put("北京哪些特色美食值得品尝？","北京烤鸭、铜锅涮肉、炸酱面、卤煮火烧、驴打滚、豆汁、焦圈、爆肚、炒肝、面茶、糖花卷、艾窝窝、糖葫芦、麻酱火烧、门钉肉饼。");
        map.put("吃北京烤鸭有哪些店值得去？","	可以前往四季民福烤鸭店、便宜坊、全聚德。");
        map.put("吃铜锅涮肉有哪些店值得去？","可以前往聚宝源、金生隆、裕德孚老北京、南门涮肉、牛街清真满恒记、天桥老金涮肉、东来顺。");
        map.put("吃炸酱面有哪些店值得去？","可以前往方砖厂69号炸酱面、海碗居、新成炸酱面馆。");
        map.put("吃卤煮火烧有哪些店值得去？","可以前往门框胡同百年卤煮、北新桥卤煮老店、护国寺小吃。");
        map.put("北京哪些经典路线值得游览？","简单为您推荐6条路线。路线一：天安门（看升旗）——国家博物馆——王府井。路线二：故宫——王府井。路线三：天安门（看升旗）——雍和宫——王府井。路线四：南锣鼓巷——烟袋斜街——什刹海——北海公园。路线五：清华北大——颐和园——圆明园——簋街。路线六：八达岭长城——明十三陵。");
        map.put("北京交通如何出行方便？","乘坐北京地铁和公交的旅客，出行前，请分别下载好“亿通行”和“北京一卡通”APP。温馨提示：乘坐公交车，上下车都要刷卡喔！");
        map.put("北京地铁1号线沿线景区有哪些？","石景山游乐园——北京国际雕塑公园——中山公园——玉渊潭公园——中华世纪坛——故宫博物院——首都博物院——国家大剧院——中国国家博物馆。");
        map.put("北京地铁2号线沿线景区有哪些？","北京钟鼓楼——雍和楼——琉璃厂文化街——什刹海——国子监孔庙——吕祖宫——五道营胡同——前门大街——鲁迅故居。");
        map.put("京地铁4号线沿线景区有哪些？","颐和园——北京大学——北京动物园——圆明园遗址公园——国家图书馆——北京天文馆——清华大学——紫竹院公园——陶然亭公园。");
        map.put("北京地铁5号线沿线景区有哪些？","榴庄公园——天坛——龙潭公园——明城墙遗址公园——老舍故居——中国美术馆——茅盾故居——段祺瑞执政府旧址——南馆公园。");
        map.put("北京地铁6号线沿线景区有哪些？","玲珑公园——北海公园——南锣鼓巷——红领巾公园——常营公园——东坝郊野公园。");
        map.put("北京地铁7号线沿线景区有哪些？","莲花池公园——北京欢乐谷。");
        map.put("北京地铁8号线沿线景区有哪些？","东小口森林公园——奥林匹克森林公园——中国科学技术馆——鸟巢——水立方——人定湖公园。");
        map.put("北京地铁9号线沿线景区有哪些？","元大都城塬遗址公园——团结湖公园——世贸天阶——潘家园旧货市场。");
        map.put("北京地铁昌平线沿线景区有哪些？","沙河水库——明十三陵——昌平公园。");
        map.put("北京地铁房山线沿线景区有哪些？","长阳公园——大葆台西汉墓博物馆——世界公园。");
        map.put("北京地铁亦庄线沿线景区有哪些？","南海子郊野公园——赤庄国际企业文化园——亦庄博大公园——麋鹿苑。");
        map.put("北京行李寄存？","北京旅游寄存行李用“存知己寄存”，北京各大景点、交通枢纽、商圈、地铁站附近超多行李寄存点，再也不用拉着行李箱逛街啦！");
        map.put("这里距离XXX多远？","调出后台程序");
        map.put("到XXX，要怎么去？","调出后台程序");
        map.put("现在XXX的人流量多吗？什么时间去最合适？", "调出后台程序");
        map.put("对于北京住宿有什么建议？", "建议住在二环以内，如：前门附近、工人体育馆附近、什刹海或南锣鼓巷圈附近，交通便利距离景点近。");
        map.put("北京特色酒店分布区域？", "天安门故宫一带保留了老北京风情，后海鼓楼一带文艺清新，国贸一带繁华奢靡，三里屯工体一带新潮前卫。");
        map.put("北京中轴线核心区及周边有哪些住宿值得选择？", "景山花园酒店、北京王府井文华东方酒店、花间堂酒店。");
        map.put("北京中轴线延长线——鸟巢有哪些住宿值得选择？", "中奥马哥孛罗大酒店中。");
        map.put("北京国贸CBD有哪些住宿值得选择？", "北京新国贸饭店。");
        map.put("北京三里屯潮流聚集地有哪些住宿值得选择？", "三里屯CHAO酒店。");
        map.put("北京西客站有哪些住宿值得选择？", "北京远通维景国际大酒店。");
        map.put("北京五棵松有哪些住宿值得选择？", "北京西长安美居酒店。");
        map.put("北京中轴线核心区及周边的酒店类型？", "四合院、豪华酒店、民宿。");
        map.put("北京中轴线延长线——鸟巢的酒店类型？", "商务酒店。");
        map.put("北京国贸CBD的酒店类型？", "豪华酒店。");
        map.put("北京三里屯潮流聚集地的酒店类型？", "豪华酒店。");
        map.put("北京西客站的酒店类型？", "经济酒店。");
        map.put("北京五棵松的酒店类型？", "经济酒店。");
        map.put("北京著名的老胡同有哪些？", "钱市胡同、灵境胡同、尺大街、九湾胡同、东交民巷、砖塔胡同、史家胡同、礼士胡同。");
        map.put("两小时参观故宫，有哪些线路方案？", "路线一：午门——太和门——弘义阁——太和殿——中和殿——保和殿——乾清宫——交泰殿——坤宁宫——御花园——神武门。路线二：午门——太和门——太和殿——保和殿西门——保和殿东门——中和殿——保和殿——乾清门——乾清宫——交泰殿——坤宁宫——御花园——神武门。");
        map.put("半天参观故宫，最佳线路方案是什么？", "午门——文华殿——太和门——太和殿——中和殿——保和殿——奉先殿——乾清宫——交泰殿——坤宁宫——养心殿——西六宫——御花园——神武门。");
        map.put("一日游参观故宫，最佳线路方案是什么？", "午门——武英殿——文华殿——太和门——太和殿——中和殿——保和殿——乾清宫——交泰殿——坤宁宫——养心殿——西六宫——御花园——东六宫——奉先殿——永寿宫——神武门。");
        map.put("北京深度游之免费骑行路线有哪些？", "这里为您提供五条线路。线路一：东交民巷——西交民巷——琉璃厂古文化街——杨梅竹斜街——大栅栏。线路二：钟鼓楼——烟袋斜街——后海北沿——后海南沿。线路三：五道营胡同——孔庙——方家胡同——菊儿胡同——南锣鼓巷。线路四：东华门——南池子——普渡寺——皇城根大门——灯市口——富强胡同——东厂胡同——隆福寺——东四——内务部街——禄米仓。线路五：菜市口地铁站——烂漫胡同——法源寺——牛街礼拜——牛街小吃街——报国寺——天宁寺。");
        map.put("北京有哪些寺庙可以祈福？", "您可以去广济寺、潭柘寺、戒台寺、红螺寺、云居寺、大觉寺、碧云寺、灵光寺、白云观。");
        map.put("北京包院民宿有哪些值得体验？", "为您推荐7所民宿。适寝（工作日1499元、节假日2490元，地址：门头沟雁翅镇碣石村65号院）；代舍（800~1000元，地址：平谷金海湖镇冬各庄大街）；花舍山间（1500元，地址：怀柔水长城景区石湖峪村桥头）；大隐于世冬奥小镇（平日2999元、周末3999元，地址：延庆张山营镇后黑龙庙村）；嵯峨馆（2499元地址：后海附近）；有术sth.here（669~1188元，地址：西城宫门口二条14号）；隐士叠院（1080元，地址：西城西河沿街159号）。");
        map.put("北京旅游伴手礼有哪些值得选购？", "北京稻香村糕点、百年義利糕点、吴裕泰茶叶、六必居酱菜、二锅头、景泰蓝、文玩字画。");
        map.put("北京稻香村糕点有哪些糕点值得选购？", "牛舌饼；山楂锅盔；枣泥方酥；拿破仑。");
        map.put("百年義利糕点有哪些糕点值得选购？", "鲜花玫瑰饼；奶酥葡萄；菊花瓣酥；大黄油饼干；奶黄酥饼。");
        map.put("六必居酱菜有哪些食品值得选购？", "海带丝；八宝菜；酱黄瓜；纯芝麻酱。");
        map.put("二锅头有哪些品牌值得选购？", "红星；牛栏山。");
        map.put("购买景泰蓝，可以去哪里选购？", "推荐前往王府井店和前门店选购。");
        map.put("购买文玩字画，可以去哪里选购？", "推荐前往潘家园路华威里18号选购。");
        map.put("北京周边有哪些古镇值得游览？", "为您推荐3处古镇，古北水镇——北京市密云区古北口镇司马台村古北水镇；蒲洼乡——北京市房山区西南；灵水村——北京市门头沟区斋堂镇。");
        map.put("北京有哪些童话小镇值得游览？", "北京园博园、北京丘比特基地、北京弗农小镇、北京祥云小镇、北京张裕爱斐堡国际酒庄。");
        map.put("去北京园博园游玩，是否有最佳游玩路线？", "亲亲，建议游玩路线：欧式园林——澳门园——北京园——忆江南。");
        map.put("去北京丘比特基地，是否有最佳游玩路线？", "亲亲，建议游玩路线：罗马柱——飞机——热气球——喷泉。");
        map.put("去北京弗农小镇，是否有最佳游玩路线？", "亲亲，建议游玩路线：钟楼花海——动物园区——老磨坊——莫奈画室——交通——叹息桥。");
        map.put("去北京祥云小镇，是否有最佳游玩路线？", "亲亲，建议游玩路线：迷你剧场——欢趣小丑show——非洲手鼓体验。");
        map.put("去北京张裕爱斐堡国际酒庄有什么需要注意的事项？", "亲亲，温馨提示：建议您自驾出行呢！建议游玩路线：葡萄酒博物馆——地下酒窖——欧式城堡九月葡萄园。");
        map.put("北京逛街最佳选择地有哪些？", "城东的朝阳大悦城、长楹天街、国贸商圈；城西的华熙LIVE（五棵松）；城南的荟聚西红门；市中心的西单大悦城、三里屯、王府井；城北的华润五彩城。");
        map.put("北京购物场所有哪些？有什么特色？", "朝阳区的北京奥特莱斯，素有“大品牌、小价格”之称；朝阳区的斯普瑞斯奥特莱斯，全欧式风格的露天购物区；朝阳区三里屯，素有“你想买的只有这儿有”；房山区的首创奥特莱斯，华北地区最大的奥特莱斯；东城区王府井步行街，北京的老牌购物胜地；西城区的西单，主打青春时尚元素，“年轻人的购物天堂”；西城区大栅栏，传统古朴手工艺品聚集地；东城区前门大街，素有“天街”之称。");
        map.put("北京有哪些玩具集合店？", "共为您推荐8家玩具集合点。旗舰店在王府井银泰一座的乐高旗舰店；王府井百货大楼南区2层的Takaratomy；王府井apm和荟聚西红门的玩具反斗城；安贞门中海环宇荟的Kids topics；木樨园百荣二期4层的百荣二期玩具城；悠唐购物中心或万达总部基地或凯德晶品的kidsland；德胜门内大街227号的好好玩具店；赵公口长途汽车站对面的国际玩具城。");
        map.put("北京有哪些书店值得逛？", "共为您推荐14家。PAGEONE、模范书局、钟书阁（融科店）、库布里克书店、莱蒎黑胶唱片、言又几（王府中环西座）、篱苑书屋、单向空间（朝阳大悦城店）、三联韬奋书店、正阳书局（西四南大街）、西西弗书店（国瑞店）、更读书社（东城隆福寺）、一个书店（龙域昌发展店）。");
        map.put("北京有哪些地方可以爬山？", "凤凰岭、妙峰山、双龙峡、百望山森林公园、八大处公园。");
        map.put("北京网红甜品店打卡胜地有哪些？有哪些推荐品尝？", "共为您推荐4家。卓拉米舒芙蕾、西树泡芙（西单大悦城店）、豆号BEAN HOUSE（新中关店）、LELECHA乐乐茶（富力广场店）。卓拉米舒芙蕾的松露巧克力提拉米苏舒芙蕾、西树泡芙的肉松咸蛋黄泡芙、豆号BEAN HOUSE的芋泥车轮饼、LELECHA乐乐茶的全部面包值得品尝哦！");
        map.put("北京小众旅游景点推荐有哪些？", "共为您推荐5处小众旅游景点，慕田峪长城、西什库教堂、白瀑寺、红砖美术馆、银河SOHO。");
        map.put("慕田峪长城的开放时间段是什么时候？", "开放时间为7:00~18：00。");
        map.put("慕田峪长城需要门票吗？", "需要，门票：40元/人。");
        map.put("西什库教堂的开放时间段是什么时候？", "开放时间为5:00~11:00、14:00~17:00。");
        map.put("西什库教堂需要门票吗？", "亲亲，西什库教堂是免费开放哒！");
        map.put("白瀑寺需要门票吗？", "亲亲，白瀑寺是免费开放哒！不过如果您要用斋饭，需要支付45元/人哦！");
        map.put("白瀑寺的开放时间段是什么时候？", "开放时间为8:00~18:00。");
        map.put("红砖美术馆的开放时间段是什么时候？", "开放时间为10:00~17:30（周一闭关）。");
        map.put("红砖美术馆需要门票吗？", "视内部展览定价门票。");
        map.put("银河SOHO需要门票吗？", "亲亲，银河SOHO是免费开放哒！");
        map.put("银河SOHO的开放时间段是什么时候？", "亲亲，银河SOHO是24小时开放！");
        map.put("北京颐和园最佳的游园路线是什么？", "从北宫门进入，苏州街——四大部落——佛香阁——排云殿——排云门——长廊——乐寿堂——宜芸馆——戏楼——德和园——玉澜堂——仁寿殿——文昌院——文昌阁——铜牛——廊如亭——十七孔桥——南湖岛，新建宫门出。");
        map.put("北京夜景最佳拍摄地有哪些？", "共为您推荐6处。西山森林公园鬼笑石、定都阁、中央电视塔、银河SOHO、北京CBD、奥林匹克塔。");
        map.put("北京哪些游乐园值得推荐？", "石景山游乐园、北京欢乐谷、乐多港——奇幻乐园、meland club（芳园里ID MALL店）、VS SPORTS PARK运动玩乐园、Sports Monster运动萌兽主题公园、Hamleys哈姆雷斯、嗨翻Hi—Fun竞技主题乐园、瑞德万国际卡丁车场。");
        map.put("北京有哪些做饼干、巧克力、陶艺等DIY场所指南？", "共为您推荐4处DIY场所，同或绘馆、野兽烘焙、金本首饰实验室、莎莉花");
        return map;
    }
}





